<?php

namespace Equifax\CreditHistory\ReferenceBooks;

if ( ! defined('ROOT')) {
    exit();
}

/**
 * Класс OKWCurrencyCodes
 * Коды валют по ОКВ
 * @version 0.0.1
 * @package Equifax\CreditHistory\ReferenceBooks\OKWCurrencyCodes
 * @generated Зорин Алексей, please DO NOT EDIT!
 * @author Зорин Алексей <zorinalexey59292@gmail.com>
 * @copyright 2022 разработчик Зорин Алексей Евгеньевич.
 */
class OKWCurrencyCodes extends \Equifax\CreditHistory\Main\Books
{

    /**
     * Значение словаря по умолчанию
     * @var string
     */
    private string $default = 'RUB';

    /**
     * Коллекция возможных значений
     * @var array
     */
    private static array $data = [
        'Лек' => [
            'code' => 'ALL',
            'counties' => [
                'Албания'
            ]
        ],
        'Алжирский динар' => [
            'code' => 'DZD',
            'counties' => [
                'Алжир'
            ]
        ],
        'Аргентинское песо' => [
            'code' => 'ARS',
            'counties' => [
                'Аргентина'
            ]
        ],
        'Австралийский доллар' => [
            'code' => 'AUD',
            'counties' => [
                'Австралия',
                'Кирибати',
                'Кокосовые (Килинг) острова',
                'Науру',
                'Остров Норфолк',
                'Остров Рождества',
                'Остров Херд и острова Макдональд',
                'Тувалу'
            ]
        ],
        'Багамский доллар' => [
            'code' => 'BSD',
            'counties' => [
                'Багамы'
            ]
        ],
        'Бахрейнский динар' => [
            'code' => 'BHD',
            'counties' => [
                'Бахрейн'
            ]
        ],
        'Така' => [
            'code' => 'BDT',
            'counties' => [
                'Бангладеш'
            ]
        ],
        'Армянский драм' => [
            'code' => 'AMD',
            'counties' => [
                'Армения'
            ]
        ],
        '' => [
            'code' => '',
            'counties' => [
                ''
            ]
        ],
        'Барбадосский доллар' => [
            'code' => 'BBD',
            'counties' => [
                'Барбадос'
            ]
        ],
        'Бермудский доллар' => [
            'code' => 'BMD',
            'counties' => [
                'Бермуды'
            ]
        ],
        'Нгултрум' => [
            'code' => 'BTN',
            'counties' => [
                'Бутан'
            ]
        ],
        'Боливиано' => [
            'code' => 'BOB',
            'counties' => [
                'Боливия'
            ]
        ],
        'Пула' => [
            'code' => 'BWP',
            'counties' => [
                'Ботсвана'
            ]
        ],
        'Белизский доллар' => [
            'code' => 'BZD',
            'counties' => [
                'Белиз'
            ]
        ],
        'Доллар Соломоновых Островов' => [
            'code' => 'SBD',
            'counties' => [
                'Соломоновы Острова'
            ]
        ],
        'Брунейский доллар' => [
            'code' => 'BND',
            'counties' => [
                'Бруней-Даруссалам'
            ]
        ],
        'Кьят' => [
            'code' => 'MMK',
            'counties' => [
                'Мьянма'
            ]
        ],
        'Бурундийский франк' => [
            'code' => 'BIF',
            'counties' => [
                'Бурунди'
            ]
        ],
        'Риель' => [
            'code' => 'KHR',
            'counties' => [
                'Камбоджа'
            ]
        ],
        'Канадский доллар' => [
            'code' => 'CAD',
            'counties' => [
                'Канада'
            ]
        ],
        'Эскудо Кабо-Верде' => [
            'code' => 'CVE',
            'counties' => [
                'Кабо-Верде'
            ]
        ],
        'Доллар Островов Кайман' => [
            'code' => 'KYD',
            'counties' => [
                'Доллар Островов Кайман'
            ]
        ],
        'Шри-ланкийская рупия' => [
            'code' => 'LKR',
            'counties' => [
                'Шри-Ланка'
            ]
        ],
        'Чилийское песо' => [
            'code' => 'CLP',
            'counties' => [
                'Чили'
            ]
        ],
        'Юань' => [
            'code' => 'CNY',
            'counties' => [
                'Китай'
            ]
        ],
        'Колумбийское песо' => [
            'code' => 'COP',
            'counties' => [
                'Колумбия'
            ]
        ],
        'Коморский франк' => [
            'code' => 'KMF',
            'counties' => [
                'Коморы'
            ]
        ],
        'Коста-риканский колон' => [
            'code' => 'CRC',
            'counties' => [
                'Коста-Рика'
            ]
        ],
        'Куна' => [
            'code' => 'HRK',
            'counties' => [
                'Хорватия'
            ]
        ],
        'Кубинское песо' => [
            'code' => 'CUP',
            'counties' => [
                'Куба'
            ]
        ],
        'Чешская крона' => [
            'code' => 'CZK',
            'counties' => [
                'Чехия'
            ]
        ],
        'Датская крона' => [
            'code' => 'DKK',
            'counties' => [
                'Гренландия',
                'Дания',
                'Фарерские острова'
            ]
        ],
        'Доминиканское песо' => [
            'code' => 'DOP',
            'counties' => [
                'Доминиканская Республика'
            ]
        ],
        'Сальвадорский колон' => [
            'code' => 'SVC',
            'counties' => [
                'Эль-Сальвадор'
            ]
        ],
        'Эфиопский быр' => [
            'code' => 'ETB',
            'counties' => [
                'Эфиопия'
            ]
        ],
        'Накфа' => [
            'code' => 'ERN',
            'counties' => [
                'Эритрея'
            ]
        ],
        'Фунт Фолклендских островов' => [
            'code' => 'FKP',
            'counties' => [
                'Фолклендские острова (Мальвинские)',
                'Фолклендские острова',
                'Мальвинские острова'
            ]
        ],
        'Доллар Фиджи' => [
            'code' => 'FJD',
            'counties' => [
                'Фиджи'
            ]
        ],
        'Франк Джибути' => [
            'code' => 'DJF',
            'counties' => [
                'Джибути'
            ]
        ],
        'Даласи' => [
            'code' => 'GMD',
            'counties' => [
                'Гамбия'
            ]
        ],
        'Гибралтарский фунт' => [
            'code' => 'GIP',
            'counties' => [
                'Гибралтар'
            ]
        ],
        'Кетсаль' => [
            'code' => 'GTQ',
            'counties' => [
                'Гватемала'
            ]
        ],
        'Гвинейский франк' => [
            'code' => 'GNF',
            'counties' => [
                'Гвинея'
            ]
        ],
        'Гайанский доллар' => [
            'code' => 'GYD',
            'counties' => [
                'Гайана'
            ]
        ],
        'Гурд' => [
            'code' => 'HTG',
            'counties' => [
                'Гаити'
            ]
        ],
        'Лемпира' => [
            'code' => 'HNL',
            'counties' => [
                'Гондурас'
            ]
        ],
        'Гонконгский доллар' => [
            'code' => 'HKD',
            'counties' => [
                'Гонконг'
            ]
        ],
        'Форинт' => [
            'code' => 'HUF',
            'counties' => [
                'Венгрия'
            ]
        ],
        'Исландская крона' => [
            'code' => 'ISK',
            'counties' => [
                'Исландия'
            ]
        ],
        'Индийская рупия' => [
            'code' => 'INR',
            'counties' => [
                'Бутан',
                'Индия'
            ]
        ],
        'Рупия' => [
            'code' => 'IDR',
            'counties' => [
                'Индонезия'
            ]
        ],
        'Иранский риал' => [
            'code' => 'IRR',
            'counties' => [
                'Иран (Исламская Республика)',
                'Иран'
            ]
        ],
        'Иракский динар' => [
            'code' => 'IQD',
            'counties' => [
                'Ирак'
            ]
        ],
        'Новый израильский шекель' => [
            'code' => 'ILS',
            'counties' => [
                'Израиль'
            ]
        ],
        '' => [
            'code' => '',
            'counties' => [
                ''
            ]
        ],
        '' => [
            'code' => '',
            'counties' => [
                ''
            ]
        ],
        '' => [
            'code' => '',
            'counties' => [
                ''
            ]
        ],
        '' => [
            'code' => '',
            'counties' => [
                ''
            ]
        ],
        '' => [
            'code' => '',
            'counties' => [
                ''
            ]
        ],
        '' => [
            'code' => '',
            'counties' => [
                ''
            ]
        ],
    ];

}
