<?php

namespace Equifax\CreditHistory\ReferenceBooks;

if ( ! defined('ROOT')) {
    exit();
}

/**
 * Класс TheVolumeOfTheOperationPerformed
 * Объём выполняемой операции, производимой с записью кредитной истории
 * @version 0.0.1
 * @package Equifax\CreditHistory\ReferenceBooks\TheVolumeOfTheOperationPerformed
 * @generated Зорин Алексей, please DO NOT EDIT!
 * @author Зорин Алексей <zorinalexey59292@gmail.com>
 * @copyright 2022 разработчик Зорин Алексей Евгеньевич. Все права защищены.
 */
class TheVolumeOfTheOperationPerformed
{

    use \Equifax\CreditHistory\Main\Books;

    private static array $data = [
        'изменение отдельных показателей кредитной истории' => 1,
        'исключение/аннулирование отдельных показателей кредитной истории' => 2,
        'аннулирование отдельных показателей кредитной истории' => 2,
        'исключение отдельных показателей кредитной истории' => 2,
        'исключение/аннулирование записи кредитной истории' => 3,
        'аннулирование записи кредитной истории' => 3,
        'исключение записи кредитной истории' => 3,
        'исключение/аннулирование всех показателей кредитной истории' => 4,
        'аннулирование всех показателей кредитной истории' => 4,
        'исключение всех показателей кредитной истории' => 4,
        'представляется непринятая бюро кредитная информация' => 5
    ];

}
