<?php

namespace Equifax\CreditHistory\ReferenceBooks;

if ( ! defined('ROOT')) {
    exit();
}

/**
 * Класс TypesOfSources
 * @version 0.0.1
 * @package Equifax\CreditHistory\ReferenceBooks\TypesOfSources
 * @generated Зорин Алексей, please DO NOT EDIT!
 * @author Зорин Алексей <zorinalexey59292@gmail.com>
 * @copyright 2022 разработчик Зорин Алексей Евгеньевич. Все права защищены.
 */
class TypesOfSources
{

    use \Equifax\CreditHistory\Main\Books;

    private static array $data = [
        'Заимодавец (кредитор) - кредитная организация' => 1,
        'Заимодавец - микрофинансовая организация' => 2,
        'Заимодавец - кредитный потребительский кооператив' => 3,
        'Заимодавец - сельскохозяйственный кредитный потребительский кооператив' => 4,
        'Заимодавец-ломбард' => 5,
        'Заимодавец - иная организация' => 6,
        'Организация-лизингодатель' => 7,
        'Оператор инвестиционной платформы' => 8,
        'Организация-гарант' => 9,
        'Организация - взыскатель платы за жилое помещение, коммунальные услуги или услуги связи' => 10,
        'Федеральный орган исполнительной власти, уполномоченный на осуществление функций по обеспечению установленного порядка деятельности судов и исполнению судебных актов и актов других органов' => 11,
        'Арбитражный управляющий' => 12,
        'Ликвидационная комиссия или ликвидатор' => 13,
        'Специализированное финансовое общество' => 14,
        'Ипотечный агент' => 15,
        'Кредитный управляющий синдиката кредиторов' => 16,
        'Лицо, осуществляющее деятельность по возврату просроченной задолженности (коллекторская организация)' => 17,
        'Иное лицо' => 18
    ];

}
